app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."nome" DESC LIMIT ?  [["LIMIT", 2]]
SELECT  "produtos".* FROM "produtos" ORDER BY "produtos"."preco" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @produtos = Produto.order(nome: :desc).limit 5
        @produto_com_desconto = Produto.order(:preco).limit 1

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Caneta"], ["descricao", "Azul"], ["preco", 2.0], ["quantidade", 100], ["created_at", "2018-09-20 13:13:58.416857"], ["updated_at", "2018-09-20 13:13:58.416857"]]
---
    def create
        produto = params.require(:produto).permit(:nome, :descricao, :preco, :quantidade)
        Produto.create produto

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 4]]
---
    def destroy
        id = params[:id]
        Produto.destroy id